Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum
The different surfacing colors.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.WHITE
The white surface color.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.RED
The red surface color.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.GREEN
The green surface color.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.BLUE
The blue surface color.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.CYAN
The cyan surface color.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.YELLOW
The yellow surface color.

Tekla.Structures.Model.SurfaceTreatment.SurfaceColorEnum.MAGENTA
The magenta surface color.